Revit 2024 API
BuiltInFailures.StairRampFailures.CannotGenerateFacesError Property
 Couldn't generate surfaces for stairs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotGenerateFacesError { get; }
Visual Basic
Public Shared ReadOnly Property CannotGenerateFacesError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotGenerateFacesError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace